name: "VGG_ILSVRC_16_layers"
layer {
  name: "data"
  type: "MultiLabelImageData"
  include {
    phase: TRAIN
  }
  transform_param {
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: true
  }
  multilabel_image_data_param {
    new_width : 224
    new_height : 224
    shuffle : 1
    source: "of500/of500_train.tab.trimmed"
    batch_size: 32
    references: 3
    max_labels: 7 
    root_folder: "of500/resized_256/"
    bounding_box_folder: "of500/output_224/"
    n_bounding_boxes: 1
  }
  top: "data"
  top: "label"
  top: "rois"
}
layer {
  name: "data"
  type: "MultiLabelImageData"
  include {
    phase: TEST
  }
  transform_param {
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: false
  }
  multilabel_image_data_param {
    new_width: 224
    new_height: 224
    shuffle : 1
    source: "of500/of500_dev.tab.trimmed"
    batch_size: 150
    references: 3
    max_labels: 7 
    root_folder: "of500/resized_256/"
    bounding_box_folder: "of500/output_224/"
    n_bounding_boxes: 1
  }
  top: "data"
  top: "label"
  top: "rois"
}

layer {
  bottom: "data"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: "ReLU"
}
layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  type: "ReLU"
}

layer {
  name: "roi_pool5"
  type: "ROIPooling"
  bottom: "conv5_3"
  bottom: "rois"
  top: "pool5"
  roi_pooling_param {
    pooled_w: 7
    pooled_h: 7
    spatial_scale: 0.0625 # 1/16
  }
}

layer {
  bottom: "pool5"
  top: "fc6"
  name: "fc6"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "relu6"
  type: "ReLU"
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc6"
  top: "fc7"
  name: "fc7"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
  }
  param{ lr_mult: 1 decay_mult: 0}
  param{ lr_mult: 1 decay_mult: 0}
}
layer {
  bottom: "fc7"
  top: "fc7"
  name: "relu7"
  type: "ReLU"
}
layer {
  bottom: "fc7"
  top: "fc7"
  name: "drop7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer{
  bottom: "fc7"
  top: "rep-frame"
  top : "rep-adjusting-Tool"
  top : "rep-adjusting-Item"
  top : "rep-adjusting-Feature"
  top : "rep-adjusting-Place"
  top : "rep-adjusting-Agent"
  top : "rep-admiring-Place"
  top : "rep-admiring-Admired"
  top : "rep-admiring-Agent"
  top : "rep-ailing-Cause"
  top : "rep-ailing-Place"
  top : "rep-ailing-Victim"
  top : "rep-ailing-VictimPart"
  top : "rep-aiming-Place"
  top : "rep-aiming-Item"
  top : "rep-aiming-Agent"
  top : "rep-aiming-Target"
  top : "rep-applauding-Place"
  top : "rep-applauding-Addressee"
  top : "rep-applauding-Agent"
  top : "rep-applying-Tool"
  top : "rep-applying-Destination"
  top : "rep-applying-Place"
  top : "rep-applying-Substance"
  top : "rep-applying-Agent"
  top : "rep-apprehending-Victim"
  top : "rep-apprehending-Place"
  top : "rep-apprehending-Agent"
  top : "rep-arching-Place"
  top : "rep-arching-BODYPART"
  top : "rep-arching-Agent"
  top : "rep-arranging-Tool"
  top : "rep-arranging-Item"
  top : "rep-arranging-Agent"
  top : "rep-arranging-Place"
  top : "rep-arresting-Suspect"
  top : "rep-arresting-Place"
  top : "rep-arresting-Agent"
  top : "rep-ascending-Agent"
  top : "rep-ascending-Place"
  top : "rep-asking-Place"
  top : "rep-asking-Addressee"
  top : "rep-asking-Agent"
  top : "rep-assembling-Tool"
  top : "rep-assembling-Component"
  top : "rep-assembling-Place"
  top : "rep-assembling-GoalItem"
  top : "rep-assembling-Agent"
  top : "rep-attaching-Destination"
  top : "rep-attaching-Tool"
  top : "rep-attaching-Item"
  top : "rep-attaching-Agent"
  top : "rep-attaching-Glue"
  top : "rep-attaching-Place"
  top : "rep-attacking-Place"
  top : "rep-attacking-Weapon"
  top : "rep-attacking-Agent"
  top : "rep-attacking-Victim"
  top : "rep-autographing-Place"
  top : "rep-autographing-Item"
  top : "rep-autographing-Receiver"
  top : "rep-autographing-Agent"
  top : "rep-baking-Place"
  top : "rep-baking-Food"
  top : "rep-baking-Agent"
  top : "rep-baking-FoodContainer"
  top : "rep-baking-HeatSource"
  top : "rep-ballooning-Agent"
  top : "rep-ballooning-Place"
  top : "rep-bandaging-VICTIM"
  top : "rep-bandaging-Place"
  top : "rep-bandaging-Agent"
  top : "rep-baptizing-BAPTIZED"
  top : "rep-baptizing-Place"
  top : "rep-baptizing-Agent"
  top : "rep-barbecuing-Place"
  top : "rep-barbecuing-Food"
  top : "rep-barbecuing-Agent"
  top : "rep-bathing-Substance"
  top : "rep-bathing-CoAgent"
  top : "rep-bathing-Tool"
  top : "rep-bathing-Place"
  top : "rep-bathing-Agent"
  top : "rep-begging-Place"
  top : "rep-begging-ITEM"
  top : "rep-begging-Agent"
  top : "rep-begging-GIVER"
  top : "rep-betting-Agent"
  top : "rep-betting-Place"
  top : "rep-biking-Agent"
  top : "rep-biking-Place"
  top : "rep-biting-Place"
  top : "rep-biting-Item"
  top : "rep-biting-Agent"
  top : "rep-blocking-Tool"
  top : "rep-blocking-Blocker"
  top : "rep-blocking-Blocked"
  top : "rep-blocking-Place"
  top : "rep-blossoming-Agent"
  top : "rep-blossoming-Place"
  top : "rep-boarding-Agent"
  top : "rep-boarding-Place"
  top : "rep-boarding-Vehicle"
  top : "rep-boating-Boaters"
  top : "rep-boating-Place"
  top : "rep-boating-Vehicle"
  top : "rep-bothering-Victim"
  top : "rep-bothering-Action"
  top : "rep-bothering-Agent"
  top : "rep-bouncing-Place"
  top : "rep-bouncing-Item"
  top : "rep-bouncing-Agent"
  top : "rep-bouncing-Surface"
  top : "rep-bowing-Agent"
  top : "rep-bowing-Place"
  top : "rep-braiding-Place"
  top : "rep-braiding-Item"
  top : "rep-braiding-Agent"
  top : "rep-branching-Brancher"
  top : "rep-branching-Place"
  top : "rep-brawling-Agent"
  top : "rep-brawling-Place"
  top : "rep-breaking-Tool"
  top : "rep-breaking-Item"
  top : "rep-breaking-Agent"
  top : "rep-breaking-Against"
  top : "rep-brewing-Target"
  top : "rep-brewing-Place"
  top : "rep-brewing-Agent"
  top : "rep-browsing-GoalItem"
  top : "rep-browsing-Place"
  top : "rep-browsing-Agent"
  top : "rep-brushing-Substance"
  top : "rep-brushing-TOOL"
  top : "rep-brushing-Target"
  top : "rep-brushing-Place"
  top : "rep-brushing-Agent"
  top : "rep-bubbling-Agent"
  top : "rep-bubbling-Place"
  top : "rep-buckling-Fastener"
  top : "rep-buckling-Item"
  top : "rep-buckling-Place"
  top : "rep-buckling-Container"
  top : "rep-buckling-Agent"
  top : "rep-building-Tool"
  top : "rep-building-Place"
  top : "rep-building-Components"
  top : "rep-building-GoalItem"
  top : "rep-building-Agent"
  top : "rep-bulldozing-Place"
  top : "rep-bulldozing-Object"
  top : "rep-bulldozing-Agent"
  top : "rep-burning-Target"
  top : "rep-burning-Place"
  top : "rep-burning-Agent"
  top : "rep-burying-Tool"
  top : "rep-burying-Item"
  top : "rep-burying-Place"
  top : "rep-burying-Destination"
  top : "rep-burying-Agent"
  top : "rep-buttering-Tool"
  top : "rep-buttering-Item"
  top : "rep-buttering-Agent"
  top : "rep-buttering-Place"
  top : "rep-butting-Target"
  top : "rep-butting-Place"
  top : "rep-butting-Agent"
  top : "rep-buttoning-Place"
  top : "rep-buttoning-Item"
  top : "rep-buttoning-Agent"
  top : "rep-buying-Place"
  top : "rep-buying-Goods"
  top : "rep-buying-Agent"
  top : "rep-buying-Payment"
  top : "rep-buying-Seller"
  top : "rep-calling-Place"
  top : "rep-calling-Tool"
  top : "rep-calling-Agent"
  top : "rep-calming-Experiencer"
  top : "rep-calming-Place"
  top : "rep-calming-Agent"
  top : "rep-camouflaging-HidingItem"
  top : "rep-camouflaging-Place"
  top : "rep-camouflaging-Agent"
  top : "rep-camping-Place"
  top : "rep-camping-Shelter"
  top : "rep-camping-Agent"
  top : "rep-caressing-RecipientPart"
  top : "rep-caressing-Place"
  top : "rep-caressing-Agent"
  top : "rep-caressing-Recipient"
  top : "rep-carrying-Place"
  top : "rep-carrying-Item"
  top : "rep-carrying-AgentPart"
  top : "rep-carrying-Agent"
  top : "rep-carting-Tool"
  top : "rep-carting-Item"
  top : "rep-carting-Agent"
  top : "rep-carting-Place"
  top : "rep-carving-SUBSTANCE"
  top : "rep-carving-Tool"
  top : "rep-carving-Agent"
  top : "rep-carving-Place"
  top : "rep-catching-CaughtItem"
  top : "rep-catching-Tool"
  top : "rep-catching-Agent"
  top : "rep-catching-Place"
  top : "rep-celebrating-Place"
  top : "rep-celebrating-Occasion"
  top : "rep-celebrating-Agent"
  top : "rep-chasing-Chasee"
  top : "rep-chasing-Place"
  top : "rep-chasing-Agent"
  top : "rep-checking-Tool"
  top : "rep-checking-Place"
  top : "rep-checking-Aspect"
  top : "rep-checking-Patient"
  top : "rep-checking-Agent"
  top : "rep-cheering-Agent"
  top : "rep-cheering-Place"
  top : "rep-cheerleading-Place"
  top : "rep-cheerleading-Supported"
  top : "rep-cheerleading-Agent"
  top : "rep-chewing-Place"
  top : "rep-chewing-Item"
  top : "rep-chewing-Agent"
  top : "rep-chiseling-Place"
  top : "rep-chiseling-Item"
  top : "rep-chiseling-Agent"
  top : "rep-chopping-Tool"
  top : "rep-chopping-Item"
  top : "rep-chopping-Agent"
  top : "rep-chopping-Place"
  top : "rep-circling-Center"
  top : "rep-circling-Place"
  top : "rep-circling-Agent"
  top : "rep-clapping-Place"
  top : "rep-clapping-AgentPart"
  top : "rep-clapping-Agent"
  top : "rep-clawing-Victim"
  top : "rep-clawing-Place"
  top : "rep-clawing-Agent"
  top : "rep-cleaning-Tool"
  top : "rep-cleaning-Source"
  top : "rep-cleaning-Agent"
  top : "rep-cleaning-Place"
  top : "rep-clearing-Tool"
  top : "rep-clearing-Item"
  top : "rep-clearing-Agent"
  top : "rep-clearing-Place"
  top : "rep-clearing-Source"
  top : "rep-clenching-Place"
  top : "rep-clenching-Item"
  top : "rep-clenching-AgentPart"
  top : "rep-clenching-Agent"
  top : "rep-climbing-Obstacle"
  top : "rep-climbing-Tool"
  top : "rep-climbing-Agent"
  top : "rep-climbing-Place"
  top : "rep-clinging-Place"
  top : "rep-clinging-ClungTo"
  top : "rep-clinging-Agent"
  top : "rep-clipping-Tool"
  top : "rep-clipping-Item"
  top : "rep-clipping-Agent"
  top : "rep-clipping-Place"
  top : "rep-clipping-Source"
  top : "rep-coaching-Place"
  top : "rep-coaching-Skill"
  top : "rep-coaching-Agent"
  top : "rep-coaching-Student"
  top : "rep-colliding-Place"
  top : "rep-colliding-Item"
  top : "rep-colliding-Agent"
  top : "rep-coloring-Tool"
  top : "rep-coloring-Item"
  top : "rep-coloring-Agent"
  top : "rep-coloring-Place"
  top : "rep-combing-Place"
  top : "rep-combing-Tool"
  top : "rep-combing-Agent"
  top : "rep-combing-Target"
  top : "rep-communicating-Adressee"
  top : "rep-communicating-Place"
  top : "rep-communicating-Agent"
  top : "rep-commuting-Place"
  top : "rep-commuting-Traveler"
  top : "rep-commuting-Vehicle"
  top : "rep-competing-Competition"
  top : "rep-competing-Place"
  top : "rep-competing-Agent"
  top : "rep-complaining-Place"
  top : "rep-complaining-Listener"
  top : "rep-complaining-Agent"
  top : "rep-confronting-Confronted"
  top : "rep-confronting-Place"
  top : "rep-confronting-Agent"
  top : "rep-congregating-Place"
  top : "rep-congregating-Individuals"
  top : "rep-constructing-Tool"
  top : "rep-constructing-Place"
  top : "rep-constructing-CreatedItem"
  top : "rep-constructing-Components"
  top : "rep-constructing-Agent"
  top : "rep-cooking-Food"
  top : "rep-cooking-Container"
  top : "rep-cooking-Agent"
  top : "rep-cooking-Tool"
  top : "rep-cooking-HeatSource"
  top : "rep-cooking-Place"
  top : "rep-coughing-Agent"
  top : "rep-coughing-Place"
  top : "rep-counting-ItemType"
  top : "rep-counting-Place"
  top : "rep-counting-Agent"
  top : "rep-covering-Place"
  top : "rep-covering-Item"
  top : "rep-covering-Agent"
  top : "rep-covering-Cover"
  top : "rep-crafting-Place"
  top : "rep-crafting-Instrument"
  top : "rep-crafting-Created"
  top : "rep-crafting-Agent"
  top : "rep-cramming-Theme"
  top : "rep-cramming-Place"
  top : "rep-cramming-Agent"
  top : "rep-cramming-Container"
  top : "rep-crashing-Place"
  top : "rep-crashing-Item"
  top : "rep-crashing-Agent"
  top : "rep-crashing-Against"
  top : "rep-crawling-Agent"
  top : "rep-crawling-Place"
  top : "rep-cresting-Agent"
  top : "rep-cresting-Place"
  top : "rep-crouching-Agent"
  top : "rep-crouching-Place"
  top : "rep-crowning-Crown"
  top : "rep-crowning-Place"
  top : "rep-crowning-Agent"
  top : "rep-crowning-CrownedEntity"
  top : "rep-crushing-Tool"
  top : "rep-crushing-Place"
  top : "rep-crushing-Agent"
  top : "rep-crushing-CrushedItem"
  top : "rep-crying-Agent"
  top : "rep-crying-Place"
  top : "rep-curling-Place"
  top : "rep-curling-Tool"
  top : "rep-curling-Agent"
  top : "rep-curling-Target"
  top : "rep-curtsying-Agent"
  top : "rep-curtsying-Place"
  top : "rep-dancing-Agent"
  top : "rep-dancing-Place"
  top : "rep-decomposing-Decomposer"
  top : "rep-decomposing-Place"
  top : "rep-decorating-Decorated"
  top : "rep-decorating-Item"
  top : "rep-decorating-Agent"
  top : "rep-decorating-Place"
  top : "rep-deflecting-Place"
  top : "rep-deflecting-Destination"
  top : "rep-deflecting-Agent"
  top : "rep-deflecting-DeflectedItem"
  top : "rep-descending-tool"
  top : "rep-descending-source"
  top : "rep-descending-Agent"
  top : "rep-descending-Place"
  top : "rep-destroying-Tool"
  top : "rep-destroying-DestroyedItem"
  top : "rep-destroying-Agent"
  top : "rep-destroying-Place"
  top : "rep-detaining-Victim"
  top : "rep-detaining-Place"
  top : "rep-detaining-Agent"
  top : "rep-dialing-Place"
  top : "rep-dialing-Item"
  top : "rep-dialing-Agent"
  top : "rep-dining-Place"
  top : "rep-dining-Food"
  top : "rep-dining-Agent"
  top : "rep-dipping-Substance"
  top : "rep-dipping-Item"
  top : "rep-dipping-Agent"
  top : "rep-dipping-Place"
  top : "rep-disciplining-Place"
  top : "rep-disciplining-Tool"
  top : "rep-disciplining-Agent"
  top : "rep-disciplining-Victim"
  top : "rep-discussing-Agents"
  top : "rep-discussing-Place"
  top : "rep-disembarking-Agent"
  top : "rep-disembarking-Place"
  top : "rep-disembarking-Vehicle"
  top : "rep-displaying-Place"
  top : "rep-displaying-Item"
  top : "rep-displaying-Agent"
  top : "rep-displaying-Target"
  top : "rep-dissecting-Tool"
  top : "rep-dissecting-Item"
  top : "rep-dissecting-Agent"
  top : "rep-dissecting-Place"
  top : "rep-distracting-Victim"
  top : "rep-distracting-Place"
  top : "rep-distracting-Agent"
  top : "rep-distributing-Tool"
  top : "rep-distributing-Place"
  top : "rep-distributing-Recipients"
  top : "rep-distributing-Distributed"
  top : "rep-distributing-Agent"
  top : "rep-diving-Agent"
  top : "rep-diving-Place"
  top : "rep-docking-Place"
  top : "rep-docking-Connector"
  top : "rep-docking-Vehicle"
  top : "rep-docking-Agent"
  top : "rep-dousing-Place"
  top : "rep-dousing-Undergoer"
  top : "rep-dousing-Agent"
  top : "rep-dousing-Liquid"
  top : "rep-dragging-Tool"
  top : "rep-dragging-Item"
  top : "rep-dragging-Place"
  top : "rep-dragging-Contact"
  top : "rep-dragging-Agent"
  top : "rep-drawing-Place"
  top : "rep-drawing-Tool"
  top : "rep-drawing-Agent"
  top : "rep-drawing-Reference"
  top : "rep-drenching-Tool"
  top : "rep-drenching-DrenchedItem"
  top : "rep-drenching-Liquid"
  top : "rep-drenching-Place"
  top : "rep-drenching-Agent"
  top : "rep-drinking-Container"
  top : "rep-drinking-Place"
  top : "rep-drinking-Agent"
  top : "rep-drinking-Liquid"
  top : "rep-dripping-Destination"
  top : "rep-dripping-Source"
  top : "rep-dripping-Fluid"
  top : "rep-dripping-Place"
  top : "rep-dripping-Agent"
  top : "rep-driving-Place"
  top : "rep-driving-Item"
  top : "rep-driving-Agent"
  top : "rep-drooling-End"
  top : "rep-drooling-Place"
  top : "rep-drooling-Agent"
  top : "rep-dropping-Place"
  top : "rep-dropping-Item"
  top : "rep-dropping-Agent"
  top : "rep-dropping-End"
  top : "rep-dropping-Start"
  top : "rep-drumming-Tool"
  top : "rep-drumming-ITEM"
  top : "rep-drumming-Agent"
  top : "rep-drumming-Place"
  top : "rep-drying-Tool"
  top : "rep-drying-Item"
  top : "rep-drying-Agent"
  top : "rep-drying-Place"
  top : "rep-ducking-Place"
  top : "rep-ducking-Blow"
  top : "rep-ducking-Agent"
  top : "rep-dusting-Tool"
  top : "rep-dusting-Source"
  top : "rep-dusting-Agent"
  top : "rep-dusting-Place"
  top : "rep-dyeing-Material"
  top : "rep-dyeing-Dye"
  top : "rep-dyeing-Agent"
  top : "rep-dyeing-Place"
  top : "rep-eating-Place"
  top : "rep-eating-Food"
  top : "rep-eating-Container"
  top : "rep-eating-Tool"
  top : "rep-eating-Agent"
  top : "rep-educating-Teacher"
  top : "rep-educating-Place"
  top : "rep-educating-Subject"
  top : "rep-educating-Student"
  top : "rep-ejecting-Destination"
  top : "rep-ejecting-Item"
  top : "rep-ejecting-Agent"
  top : "rep-ejecting-Place"
  top : "rep-ejecting-Source"
  top : "rep-embracing-Place"
  top : "rep-embracing-Coagent"
  top : "rep-embracing-Agent"
  top : "rep-emerging-Destination"
  top : "rep-emerging-Source"
  top : "rep-emerging-Agent"
  top : "rep-emerging-Place"
  top : "rep-emptying-Tool"
  top : "rep-emptying-Container"
  top : "rep-emptying-Agent"
  top : "rep-emptying-Destination"
  top : "rep-emptying-Place"
  top : "rep-emptying-Item"
  top : "rep-encouraging-Agent"
  top : "rep-encouraging-Place"
  top : "rep-encouraging-Reciever"
  top : "rep-erasing-Source"
  top : "rep-erasing-Erased"
  top : "rep-erasing-Agent"
  top : "rep-erasing-Place"
  top : "rep-erupting-Place"
  top : "rep-erupting-Substance"
  top : "rep-erupting-Agent"
  top : "rep-examining-Tool"
  top : "rep-examining-Item"
  top : "rep-examining-Agent"
  top : "rep-examining-Place"
  top : "rep-exercising-Place"
  top : "rep-exercising-AgentPart"
  top : "rep-exercising-Agent"
  top : "rep-exterminating-Place"
  top : "rep-exterminating-Instrument"
  top : "rep-exterminating-Agent"
  top : "rep-extinguishing-Tool"
  top : "rep-extinguishing-Item"
  top : "rep-extinguishing-Agent"
  top : "rep-extinguishing-Place"
  top : "rep-falling-Place"
  top : "rep-falling-Source"
  top : "rep-falling-Agent"
  top : "rep-falling-Goal"
  top : "rep-farming-Tool"
  top : "rep-farming-Item"
  top : "rep-farming-Place"
  top : "rep-farming-Ground"
  top : "rep-farming-Farmer"
  top : "rep-fastening-Destination"
  top : "rep-fastening-Tool"
  top : "rep-fastening-Connector"
  top : "rep-fastening-Agent"
  top : "rep-fastening-Place"
  top : "rep-fastening-Item"
  top : "rep-feeding-Source"
  top : "rep-feeding-Food"
  top : "rep-feeding-Place"
  top : "rep-feeding-Eater"
  top : "rep-feeding-Agent"
  top : "rep-fetching-Destination"
  top : "rep-fetching-Item"
  top : "rep-fetching-Agent"
  top : "rep-fetching-Place"
  top : "rep-fetching-Source"
  top : "rep-filling-Destination"
  top : "rep-filling-Item"
  top : "rep-filling-Agent"
  top : "rep-filling-Place"
  top : "rep-filling-Source"
  top : "rep-filming-Performer"
  top : "rep-filming-Tool"
  top : "rep-filming-Agent"
  top : "rep-filming-Place"
  top : "rep-fishing-Tool"
  top : "rep-fishing-SOURCE"
  top : "rep-fishing-Agent"
  top : "rep-fishing-Place"
  top : "rep-fixing-Tool"
  top : "rep-fixing-Place"
  top : "rep-fixing-ObjectPart"
  top : "rep-fixing-Object"
  top : "rep-fixing-Agent"
  top : "rep-flaming-Agent"
  top : "rep-flaming-Place"
  top : "rep-flapping-Place"
  top : "rep-flapping-BodyPart"
  top : "rep-flapping-Agent"
  top : "rep-flexing-Addressee"
  top : "rep-flexing-AgentPart"
  top : "rep-flexing-Agent"
  top : "rep-flexing-Place"
  top : "rep-flicking-Place"
  top : "rep-flicking-AgentPart"
  top : "rep-flicking-ObjectPart"
  top : "rep-flicking-Object"
  top : "rep-flicking-Agent"
  top : "rep-flinging-Tool"
  top : "rep-flinging-Item"
  top : "rep-flinging-Goal"
  top : "rep-flinging-Place"
  top : "rep-flinging-Agent"
  top : "rep-flipping-Place"
  top : "rep-flipping-Tool"
  top : "rep-flipping-Flipped"
  top : "rep-flipping-Agent"
  top : "rep-floating-Medium"
  top : "rep-floating-Tool"
  top : "rep-floating-Agent"
  top : "rep-floating-Place"
  top : "rep-flossing-Place"
  top : "rep-flossing-CoAgent"
  top : "rep-flossing-Agent"
  top : "rep-folding-Shape"
  top : "rep-folding-Cloth"
  top : "rep-folding-Agent"
  top : "rep-folding-Place"
  top : "rep-foraging-Place"
  top : "rep-foraging-Item"
  top : "rep-foraging-Agent"
  top : "rep-fording-Place"
  top : "rep-fording-Tool"
  top : "rep-fording-Agent"
  top : "rep-frisking-Victim"
  top : "rep-frisking-Place"
  top : "rep-frisking-Agent"
  top : "rep-frowning-Agent"
  top : "rep-frowning-Place"
  top : "rep-frying-Place"
  top : "rep-frying-Food"
  top : "rep-frying-Agent"
  top : "rep-frying-Container"
  top : "rep-fueling-Tool"
  top : "rep-fueling-Place"
  top : "rep-fueling-Agent"
  top : "rep-fueling-Recipient"
  top : "rep-gambling-Place"
  top : "rep-gambling-Stake"
  top : "rep-gambling-Agent"
  top : "rep-gardening-Place"
  top : "rep-gardening-Tool"
  top : "rep-gardening-Agent"
  top : "rep-gasping-Agent"
  top : "rep-gasping-Place"
  top : "rep-gathering-Gatherers"
  top : "rep-gathering-Place"
  top : "rep-giggling-Target"
  top : "rep-giggling-Place"
  top : "rep-giggling-Agent"
  top : "rep-giving-Place"
  top : "rep-giving-Item"
  top : "rep-giving-Agent"
  top : "rep-giving-Recipient"
  top : "rep-glaring-Perceiver"
  top : "rep-glaring-Place"
  top : "rep-glaring-Agent"
  top : "rep-glowing-Agent"
  top : "rep-glowing-Place"
  top : "rep-gluing-Item"
  top : "rep-gluing-Connector"
  top : "rep-gluing-Goal"
  top : "rep-gluing-Place"
  top : "rep-gluing-Agent"
  top : "rep-gnawing-Place"
  top : "rep-gnawing-Item"
  top : "rep-gnawing-Agent"
  top : "rep-grieving-Agent"
  top : "rep-grieving-Place"
  top : "rep-grilling-Place"
  top : "rep-grilling-Food"
  top : "rep-grilling-Agent"
  top : "rep-grimacing-Cause"
  top : "rep-grimacing-Place"
  top : "rep-grimacing-Agent"
  top : "rep-grinding-Tool"
  top : "rep-grinding-Item"
  top : "rep-grinding-Surface"
  top : "rep-grinding-Place"
  top : "rep-grinding-Agent"
  top : "rep-grinning-Agent"
  top : "rep-grinning-Place"
  top : "rep-guarding-Weapon"
  top : "rep-guarding-Item"
  top : "rep-guarding-Agent"
  top : "rep-guarding-Place"
  top : "rep-handcuffing-Victim"
  top : "rep-handcuffing-Place"
  top : "rep-handcuffing-Agent"
  top : "rep-hanging-Scaffold"
  top : "rep-hanging-Item"
  top : "rep-hanging-Agent"
  top : "rep-hanging-Place"
  top : "rep-harvesting-Tool"
  top : "rep-harvesting-HarvestedItem"
  top : "rep-harvesting-Agent"
  top : "rep-harvesting-Place"
  top : "rep-harvesting-Ground"
  top : "rep-hauling-Tool"
  top : "rep-hauling-Item"
  top : "rep-hauling-Place"
  top : "rep-hauling-Carrier"
  top : "rep-heaving-Tool"
  top : "rep-heaving-HeavedItem"
  top : "rep-heaving-Agent"
  top : "rep-heaving-Place"
  top : "rep-helping-Place"
  top : "rep-helping-Tool"
  top : "rep-helping-EntityHelped"
  top : "rep-helping-Agent"
  top : "rep-hiking-Agent"
  top : "rep-hiking-Place"
  top : "rep-hitchhiking-Agent"
  top : "rep-hitchhiking-Place"
  top : "rep-hitting-Place"
  top : "rep-hitting-Tool"
  top : "rep-hitting-Agent"
  top : "rep-hitting-Victim"
  top : "rep-hitting-VictimPart"
  top : "rep-hoeing-Agent"
  top : "rep-hoeing-Place"
  top : "rep-hoeing-Ground"
  top : "rep-hoisting-Tool"
  top : "rep-hoisting-Item"
  top : "rep-hoisting-Agent"
  top : "rep-hoisting-Place"
  top : "rep-hoisting-Source"
  top : "rep-hugging-Hugged"
  top : "rep-hugging-AgentPart"
  top : "rep-hugging-Agent"
  top : "rep-hugging-Place"
  top : "rep-hunching-Surface"
  top : "rep-hunching-Place"
  top : "rep-hunching-Agent"
  top : "rep-hunting-Place"
  top : "rep-hunting-Hunted"
  top : "rep-hunting-Agent"
  top : "rep-hurling-Place"
  top : "rep-hurling-Start"
  top : "rep-hurling-End"
  top : "rep-hurling-Object"
  top : "rep-hurling-Agent"
  top : "rep-igniting-Tool"
  top : "rep-igniting-Item"
  top : "rep-igniting-Agent"
  top : "rep-igniting-Place"
  top : "rep-ignoring-BoringThing"
  top : "rep-ignoring-Place"
  top : "rep-ignoring-Agent"
  top : "rep-imitating-Place"
  top : "rep-imitating-Model"
  top : "rep-imitating-Agent"
  top : "rep-immersing-Place"
  top : "rep-immersing-Item"
  top : "rep-immersing-Agent"
  top : "rep-immersing-Liquid"
  top : "rep-inflating-Object"
  top : "rep-inflating-Tool"
  top : "rep-inflating-Agent"
  top : "rep-inflating-Place"
  top : "rep-injecting-Source"
  top : "rep-injecting-Destination"
  top : "rep-injecting-Place"
  top : "rep-injecting-Substance"
  top : "rep-injecting-Agent"
  top : "rep-inserting-Object"
  top : "rep-inserting-Place"
  top : "rep-inserting-Agent"
  top : "rep-inserting-Container"
  top : "rep-installing-Tool"
  top : "rep-installing-Place"
  top : "rep-installing-Component"
  top : "rep-installing-Destination"
  top : "rep-installing-Agent"
  top : "rep-instructing-Student"
  top : "rep-instructing-Place"
  top : "rep-instructing-Agent"
  top : "rep-intermingling-Agents"
  top : "rep-intermingling-Place"
  top : "rep-interrogating-Addressee"
  top : "rep-interrogating-Tool"
  top : "rep-interrogating-Agent"
  top : "rep-interrogating-Place"
  top : "rep-interviewing-Interviewee"
  top : "rep-interviewing-Place"
  top : "rep-interviewing-Agent"
  top : "rep-jogging-Agent"
  top : "rep-jogging-Place"
  top : "rep-juggling-Place"
  top : "rep-juggling-Items"
  top : "rep-juggling-Agent"
  top : "rep-jumping-Source"
  top : "rep-jumping-Destination"
  top : "rep-jumping-Place"
  top : "rep-jumping-Obstacle"
  top : "rep-jumping-Agent"
  top : "rep-kicking-Victim"
  top : "rep-kicking-Place"
  top : "rep-kicking-VictimPart"
  top : "rep-kicking-Agent"
  top : "rep-kissing-CoAgent"
  top : "rep-kissing-AgentPart"
  top : "rep-kissing-CoAgentPart"
  top : "rep-kissing-Place"
  top : "rep-kissing-Agent"
  top : "rep-kneading-Place"
  top : "rep-kneading-Item"
  top : "rep-kneading-Agent"
  top : "rep-kneeling-Place"
  top : "rep-kneeling-Contact"
  top : "rep-kneeling-Agent"
  top : "rep-knocking-Place"
  top : "rep-knocking-Item"
  top : "rep-knocking-Agent"
  top : "rep-lacing-Place"
  top : "rep-lacing-Item"
  top : "rep-lacing-Agent"
  top : "rep-landing-Place"
  top : "rep-landing-Destination"
  top : "rep-landing-Agent"
  top : "rep-lapping-Place"
  top : "rep-lapping-Food"
  top : "rep-lapping-Agent"
  top : "rep-lapping-Container"
  top : "rep-lathering-Substance"
  top : "rep-lathering-Destination"
  top : "rep-lathering-Agent"
  top : "rep-lathering-Place"
  top : "rep-laughing-Agent"
  top : "rep-laughing-Place"
  top : "rep-launching-Destination"
  top : "rep-launching-Item"
  top : "rep-launching-Agent"
  top : "rep-launching-Place"
  top : "rep-launching-Source"
  top : "rep-leading-Place"
  top : "rep-leading-Follower"
  top : "rep-leading-Agent"
  top : "rep-leaking-Source"
  top : "rep-leaking-Destination"
  top : "rep-leaking-Place"
  top : "rep-leaking-Substance"
  top : "rep-leaning-Place"
  top : "rep-leaning-Item"
  top : "rep-leaning-Agent"
  top : "rep-leaning-Against"
  top : "rep-leaping-Source"
  top : "rep-leaping-Destination"
  top : "rep-leaping-Place"
  top : "rep-leaping-Obstacle"
  top : "rep-leaping-Agent"
  top : "rep-lecturing-Place"
  top : "rep-lecturing-Audience"
  top : "rep-lecturing-Agent"
  top : "rep-licking-Place"
  top : "rep-licking-Item"
  top : "rep-licking-Agent"
  top : "rep-lifting-Place"
  top : "rep-lifting-Item"
  top : "rep-lifting-Agent"
  top : "rep-lifting-End"
  top : "rep-lifting-Start"
  top : "rep-lighting-Tool"
  top : "rep-lighting-Item"
  top : "rep-lighting-Agent"
  top : "rep-lighting-Place"
  top : "rep-loading-Tool"
  top : "rep-loading-Item"
  top : "rep-loading-Place"
  top : "rep-loading-Destination"
  top : "rep-loading-Agent"
  top : "rep-locking-Tool"
  top : "rep-locking-Item"
  top : "rep-locking-Agent"
  top : "rep-locking-Place"
  top : "rep-making-Tool"
  top : "rep-making-Component"
  top : "rep-making-Place"
  top : "rep-making-GoalItem"
  top : "rep-making-Agent"
  top : "rep-manicuring-Tool"
  top : "rep-manicuring-Item"
  top : "rep-manicuring-Agent"
  top : "rep-manicuring-Place"
  top : "rep-marching-Agent"
  top : "rep-marching-Place"
  top : "rep-mashing-Tool"
  top : "rep-mashing-Item"
  top : "rep-mashing-Agent"
  top : "rep-mashing-Place"
  top : "rep-massaging-Place"
  top : "rep-massaging-CoAgent"
  top : "rep-massaging-Agent"
  top : "rep-massaging-CoAgentPart"
  top : "rep-measuring-Object"
  top : "rep-measuring-Tool"
  top : "rep-measuring-Agent"
  top : "rep-measuring-Place"
  top : "rep-measuring-Quantity"
  top : "rep-mending-Tool"
  top : "rep-mending-Item"
  top : "rep-mending-Agent"
  top : "rep-mending-Place"
  top : "rep-microwaving-Place"
  top : "rep-microwaving-Food"
  top : "rep-microwaving-Agent"
  top : "rep-microwaving-Container"
  top : "rep-milking-Tool"
  top : "rep-milking-Source"
  top : "rep-milking-Place"
  top : "rep-milking-Destination"
  top : "rep-milking-Agent"
  top : "rep-miming-Imitation"
  top : "rep-miming-Place"
  top : "rep-miming-Agent"
  top : "rep-mining-Tool"
  top : "rep-mining-Place"
  top : "rep-mining-Agent"
  top : "rep-mining-Resource"
  top : "rep-misbehaving-Agent"
  top : "rep-misbehaving-Place"
  top : "rep-moistening-Place"
  top : "rep-moistening-Item"
  top : "rep-moistening-Agent"
  top : "rep-moistening-Liquid"
  top : "rep-moisturizing-Tool"
  top : "rep-moisturizing-Place"
  top : "rep-moisturizing-Agent"
  top : "rep-moisturizing-Moisturized"
  top : "rep-molding-Substance"
  top : "rep-molding-Place"
  top : "rep-molding-Agent"
  top : "rep-molding-GoalItem"
  top : "rep-mopping-Surface"
  top : "rep-mopping-Place"
  top : "rep-mopping-Agent"
  top : "rep-mourning-Mourner"
  top : "rep-mourning-Place"
  top : "rep-mowing-Tool"
  top : "rep-mowing-Item"
  top : "rep-mowing-Agent"
  top : "rep-mowing-Place"
  top : "rep-nagging-NaggedPerson"
  top : "rep-nagging-Place"
  top : "rep-nagging-Agent"
  top : "rep-nailing-Tool"
  top : "rep-nailing-Item2"
  top : "rep-nailing-Place"
  top : "rep-nailing-Item1"
  top : "rep-nailing-Agent"
  top : "rep-nipping-Place"
  top : "rep-nipping-Item"
  top : "rep-nipping-Agent"
  top : "rep-nuzzling-Place"
  top : "rep-nuzzling-Item"
  top : "rep-nuzzling-Agent"
  top : "rep-offering-Item"
  top : "rep-offering-Beneficiary"
  top : "rep-offering-Agent"
  top : "rep-offering-Place"
  top : "rep-officiating-Event"
  top : "rep-officiating-Place"
  top : "rep-officiating-Agent"
  top : "rep-opening-Tool"
  top : "rep-opening-Item"
  top : "rep-opening-Agent"
  top : "rep-opening-Place"
  top : "rep-operating-Tool"
  top : "rep-operating-Item"
  top : "rep-operating-Agent"
  top : "rep-operating-Place"
  top : "rep-overflowing-Place"
  top : "rep-overflowing-Source"
  top : "rep-overflowing-Agent"
  top : "rep-packaging-Place"
  top : "rep-packaging-Item"
  top : "rep-packaging-Agent"
  top : "rep-packing-Place"
  top : "rep-packing-Item"
  top : "rep-packing-Agent"
  top : "rep-packing-Container"
  top : "rep-painting-Tool"
  top : "rep-painting-Item"
  top : "rep-painting-Agent"
  top : "rep-painting-Place"
  top : "rep-panhandling-Target"
  top : "rep-panhandling-Place"
  top : "rep-panhandling-Agent"
  top : "rep-parachuting-Destination"
  top : "rep-parachuting-Parachute"
  top : "rep-parachuting-Agent"
  top : "rep-parachuting-Place"
  top : "rep-parading-Agent"
  top : "rep-parading-Place"
  top : "rep-pasting-Item"
  top : "rep-pasting-Connector"
  top : "rep-pasting-Place"
  top : "rep-pasting-Object"
  top : "rep-pasting-Agent"
  top : "rep-patting-Tool"
  top : "rep-patting-Item"
  top : "rep-patting-Agent"
  top : "rep-patting-Place"
  top : "rep-pawing-PawedItem"
  top : "rep-pawing-AgentPart"
  top : "rep-pawing-Agent"
  top : "rep-pawing-Place"
  top : "rep-paying-Place"
  top : "rep-paying-Good"
  top : "rep-paying-Seller"
  top : "rep-paying-Agent"
  top : "rep-pedaling-Agent"
  top : "rep-pedaling-Place"
  top : "rep-pedaling-Vehicle"
  top : "rep-peeing-Target"
  top : "rep-peeing-Place"
  top : "rep-peeing-Agent"
  top : "rep-peeling-Tool"
  top : "rep-peeling-Item"
  top : "rep-peeling-Agent"
  top : "rep-peeling-Place"
  top : "rep-performing-Place"
  top : "rep-performing-Tool"
  top : "rep-performing-Agent"
  top : "rep-performing-Event"
  top : "rep-performing-Stage"
  top : "rep-perspiring-Agent"
  top : "rep-perspiring-Place"
  top : "rep-phoning-Place"
  top : "rep-phoning-Tool"
  top : "rep-phoning-Agent"
  top : "rep-photographing-Tool"
  top : "rep-photographing-Item"
  top : "rep-photographing-Agent"
  top : "rep-photographing-Place"
  top : "rep-picking-Place"
  top : "rep-picking-Source"
  top : "rep-picking-Agent"
  top : "rep-picking-Crop"
  top : "rep-piloting-Place"
  top : "rep-piloting-Start"
  top : "rep-piloting-Agent"
  top : "rep-piloting-End"
  top : "rep-piloting-Vehicle"
  top : "rep-pinching-Object"
  top : "rep-pinching-Place"
  top : "rep-pinching-Agent"
  top : "rep-pinching-ObjectPart"
  top : "rep-pinning-Destination"
  top : "rep-pinning-Pinned"
  top : "rep-pinning-Agent"
  top : "rep-pinning-Place"
  top : "rep-pitching-Place"
  top : "rep-pitching-Tool"
  top : "rep-pitching-Agent"
  top : "rep-pitching-Pitched"
  top : "rep-placing-Destination"
  top : "rep-placing-PlacedItem"
  top : "rep-placing-Agent"
  top : "rep-placing-Place"
  top : "rep-planting-Tool"
  top : "rep-planting-CoParticipant"
  top : "rep-planting-Place"
  top : "rep-planting-Planted"
  top : "rep-planting-Agent"
  top : "rep-plowing-Place"
  top : "rep-plowing-Instrument"
  top : "rep-plowing-Agent"
  top : "rep-plummeting-Destination"
  top : "rep-plummeting-Start"
  top : "rep-plummeting-Agent"
  top : "rep-plummeting-Place"
  top : "rep-plunging-Destination"
  top : "rep-plunging-Place"
  top : "rep-plunging-Agent"
  top : "rep-plunging-Plunged"
  top : "rep-poking-Tool"
  top : "rep-poking-Place"
  top : "rep-poking-ObjectPart"
  top : "rep-poking-Object"
  top : "rep-poking-Agent"
  top : "rep-pooing-Place"
  top : "rep-pooing-Destination"
  top : "rep-pooing-Agent"
  top : "rep-potting-Place"
  top : "rep-potting-Item"
  top : "rep-potting-Agent"
  top : "rep-potting-Container"
  top : "rep-pouncing-Place"
  top : "rep-pouncing-Destination"
  top : "rep-pouncing-Agent"
  top : "rep-pouring-Tool"
  top : "rep-pouring-Substance"
  top : "rep-pouring-Agent"
  top : "rep-pouring-Destination"
  top : "rep-pouring-Place"
  top : "rep-pouring-Source"
  top : "rep-pouting-Agent"
  top : "rep-pouting-Place"
  top : "rep-practicing-Place"
  top : "rep-practicing-Skill"
  top : "rep-practicing-Agent"
  top : "rep-practicing-Tool"
  top : "rep-praying-Agent"
  top : "rep-praying-Place"
  top : "rep-preaching-Place"
  top : "rep-preaching-Addressee"
  top : "rep-preaching-Agent"
  top : "rep-pressing-Place"
  top : "rep-pressing-Item"
  top : "rep-pressing-Agent"
  top : "rep-pricking-Tool"
  top : "rep-pricking-Pricked"
  top : "rep-pricking-Agent"
  top : "rep-pricking-Place"
  top : "rep-protesting-Agent"
  top : "rep-protesting-Place"
  top : "rep-providing-Place"
  top : "rep-providing-Item"
  top : "rep-providing-Agent"
  top : "rep-providing-Recipient"
  top : "rep-providing-Source"
  top : "rep-prowling-Target"
  top : "rep-prowling-Place"
  top : "rep-prowling-Agent"
  top : "rep-pruning-RemovedItem"
  top : "rep-pruning-Source"
  top : "rep-pruning-Tool"
  top : "rep-pruning-Place"
  top : "rep-pruning-Agent"
  top : "rep-prying-Tool"
  top : "rep-prying-Item"
  top : "rep-prying-Place"
  top : "rep-prying-From"
  top : "rep-prying-Agent"
  top : "rep-puckering-Place"
  top : "rep-puckering-AgentPart"
  top : "rep-puckering-Agent"
  top : "rep-pulling-Tool"
  top : "rep-pulling-Item"
  top : "rep-pulling-Agent"
  top : "rep-pulling-Place"
  top : "rep-pumping-Tool"
  top : "rep-pumping-Substance"
  top : "rep-pumping-Agent"
  top : "rep-pumping-Destination"
  top : "rep-pumping-Place"
  top : "rep-pumping-Source"
  top : "rep-punching-Place"
  top : "rep-punching-BodyPart"
  top : "rep-punching-Agent"
  top : "rep-punching-Victim"
  top : "rep-punting-Place"
  top : "rep-punting-Item"
  top : "rep-punting-Agent"
  top : "rep-pushing-Place"
  top : "rep-pushing-Item"
  top : "rep-pushing-AgentPart"
  top : "rep-pushing-Agent"
  top : "rep-putting-Destination"
  top : "rep-putting-Item"
  top : "rep-putting-Agent"
  top : "rep-putting-Place"
  top : "rep-queuing-Agent"
  top : "rep-queuing-Place"
  top : "rep-racing-Agent"
  top : "rep-racing-Place"
  top : "rep-rafting-Agent"
  top : "rep-rafting-Place"
  top : "rep-raining-Place"
  top : "rep-raking-Destination"
  top : "rep-raking-Item"
  top : "rep-raking-Agent"
  top : "rep-raking-Place"
  top : "rep-raking-Source"
  top : "rep-ramming-Victim"
  top : "rep-ramming-Place"
  top : "rep-ramming-RammingItem"
  top : "rep-ramming-Agent"
  top : "rep-reading-Place"
  top : "rep-reading-Item"
  top : "rep-reading-Agent"
  top : "rep-rearing-Agent"
  top : "rep-rearing-Place"
  top : "rep-reassuring-Place"
  top : "rep-reassuring-Reassured"
  top : "rep-reassuring-Agent"
  top : "rep-recording-Phenomenon"
  top : "rep-recording-Place"
  top : "rep-recording-Agent"
  top : "rep-recovering-Ailment"
  top : "rep-recovering-Place"
  top : "rep-recovering-Agent"
  top : "rep-recuperating-Agent"
  top : "rep-recuperating-Place"
  top : "rep-rehabilitating-Place"
  top : "rep-rehabilitating-Item"
  top : "rep-rehabilitating-Agent"
  top : "rep-releasing-Place"
  top : "rep-releasing-ReleasedItem"
  top : "rep-releasing-Agent"
  top : "rep-repairing-Problem"
  top : "rep-repairing-Item"
  top : "rep-repairing-Tool"
  top : "rep-repairing-Place"
  top : "rep-repairing-Agent"
  top : "rep-resting-Place"
  top : "rep-resting-Item"
  top : "rep-resting-Agent"
  top : "rep-resting-Goal"
  top : "rep-restraining-Restrained"
  top : "rep-restraining-Place"
  top : "rep-restraining-Agent"
  top : "rep-retrieving-Object"
  top : "rep-retrieving-Start"
  top : "rep-retrieving-Agent"
  top : "rep-retrieving-Place"
  top : "rep-riding-Agent"
  top : "rep-riding-Place"
  top : "rep-riding-Vehicle"
  top : "rep-rinsing-Object"
  top : "rep-rinsing-Tool"
  top : "rep-rinsing-Agent"
  top : "rep-rinsing-Place"
  top : "rep-rocking-Container"
  top : "rep-rocking-Place"
  top : "rep-rocking-Agent"
  top : "rep-rocking-Rocked"
  top : "rep-rotting-Container"
  top : "rep-rotting-Place"
  top : "rep-rotting-Agent"
  top : "rep-rowing-Agent"
  top : "rep-rowing-Place"
  top : "rep-rowing-Vehicle"
  top : "rep-rubbing-Place"
  top : "rep-rubbing-Item"
  top : "rep-rubbing-AgentPart"
  top : "rep-rubbing-Agent"
  top : "rep-running-Agent"
  top : "rep-running-Place"
  top : "rep-saluting-Target"
  top : "rep-saluting-Place"
  top : "rep-saluting-Agent"
  top : "rep-saying-Adressee"
  top : "rep-saying-Place"
  top : "rep-saying-Agent"
  top : "rep-scolding-Victim"
  top : "rep-scolding-Place"
  top : "rep-scolding-Agent"
  top : "rep-scooping-Tool"
  top : "rep-scooping-Item"
  top : "rep-scooping-Agent"
  top : "rep-scooping-Place"
  top : "rep-scooping-Source"
  top : "rep-scoring-Agent"
  top : "rep-scoring-Place"
  top : "rep-scraping-Place"
  top : "rep-scraping-ScrapedItem"
  top : "rep-scraping-Agent"
  top : "rep-scraping-Tool"
  top : "rep-scratching-Object"
  top : "rep-scratching-Tool"
  top : "rep-scratching-Agent"
  top : "rep-scratching-Place"
  top : "rep-scrubbing-Tool"
  top : "rep-scrubbing-Item"
  top : "rep-scrubbing-Agent"
  top : "rep-scrubbing-Place"
  top : "rep-sealing-Place"
  top : "rep-sealing-Item"
  top : "rep-sealing-Sealant"
  top : "rep-sealing-Agent"
  top : "rep-selling-Item"
  top : "rep-selling-Buyer"
  top : "rep-selling-Seller"
  top : "rep-selling-Place"
  top : "rep-serving-Place"
  top : "rep-serving-Item"
  top : "rep-serving-Served"
  top : "rep-serving-Agent"
  top : "rep-sewing-Tool"
  top : "rep-sewing-Item"
  top : "rep-sewing-Agent"
  top : "rep-sewing-Place"
  top : "rep-shaking-Tool"
  top : "rep-shaking-Item"
  top : "rep-shaking-Agent"
  top : "rep-shaking-Place"
  top : "rep-sharpening-Tool"
  top : "rep-sharpening-Item"
  top : "rep-sharpening-Agent"
  top : "rep-sharpening-Place"
  top : "rep-shaving-CoAgent"
  top : "rep-shaving-Substance"
  top : "rep-shaving-Place"
  top : "rep-shaving-Agent"
  top : "rep-shaving-Tool"
  top : "rep-shaving-BodyPart"
  top : "rep-shearing-Place"
  top : "rep-shearing-Item"
  top : "rep-shearing-Source"
  top : "rep-shearing-Agent"
  top : "rep-shelling-Place"
  top : "rep-shelling-Object"
  top : "rep-shelling-Agent"
  top : "rep-shelving-Destination"
  top : "rep-shelving-Item"
  top : "rep-shelving-Agent"
  top : "rep-shelving-Place"
  top : "rep-shivering-Agent"
  top : "rep-shivering-Place"
  top : "rep-shooting-Firearm"
  top : "rep-shooting-Target"
  top : "rep-shooting-Projectile"
  top : "rep-shooting-Agent"
  top : "rep-shopping-Place"
  top : "rep-shopping-Goods"
  top : "rep-shopping-Agent"
  top : "rep-shouting-Place"
  top : "rep-shouting-Addressee"
  top : "rep-shouting-Agent"
  top : "rep-shoveling-Place"
  top : "rep-shoveling-Item"
  top : "rep-shoveling-Source"
  top : "rep-shoveling-Agent"
  top : "rep-shredding-Tool"
  top : "rep-shredding-Item"
  top : "rep-shredding-Agent"
  top : "rep-shredding-Place"
  top : "rep-shrugging-Agent"
  top : "rep-shrugging-Place"
  top : "rep-shushing-Target"
  top : "rep-shushing-Place"
  top : "rep-shushing-Agent"
  top : "rep-signaling-Message"
  top : "rep-signaling-Place"
  top : "rep-signaling-Tool"
  top : "rep-signaling-Recipient"
  top : "rep-signaling-Agent"
  top : "rep-signing-Place"
  top : "rep-signing-Tool"
  top : "rep-signing-SignedItem"
  top : "rep-signing-Agent"
  top : "rep-singing-Agent"
  top : "rep-singing-Place"
  top : "rep-sitting-Place"
  top : "rep-sitting-Contact"
  top : "rep-sitting-Agent"
  top : "rep-skating-Agent"
  top : "rep-skating-Place"
  top : "rep-skating-Vehicle"
  top : "rep-sketching-Material"
  top : "rep-sketching-Image"
  top : "rep-sketching-Tool"
  top : "rep-sketching-Place"
  top : "rep-sketching-Agent"
  top : "rep-skidding-Agent"
  top : "rep-skidding-Place"
  top : "rep-skiing-Agent"
  top : "rep-skiing-Place"
  top : "rep-skipping-Place"
  top : "rep-skipping-Obstacle"
  top : "rep-skipping-Agent"
  top : "rep-slapping-Place"
  top : "rep-slapping-Tool"
  top : "rep-slapping-Agent"
  top : "rep-slapping-Victim"
  top : "rep-slapping-VictimPart"
  top : "rep-sleeping-Agent"
  top : "rep-sleeping-Place"
  top : "rep-slicing-Tool"
  top : "rep-slicing-SlicedItem"
  top : "rep-slicing-Agent"
  top : "rep-slicing-Place"
  top : "rep-sliding-Destination"
  top : "rep-sliding-Slider"
  top : "rep-sliding-Surface"
  top : "rep-sliding-Place"
  top : "rep-sliding-Agent"
  top : "rep-slipping-Place"
  top : "rep-slipping-Destination"
  top : "rep-slipping-Agent"
  top : "rep-slithering-Agent"
  top : "rep-slithering-Place"
  top : "rep-slouching-Place"
  top : "rep-slouching-Contact"
  top : "rep-slouching-Agent"
  top : "rep-smashing-Tool"
  top : "rep-smashing-Smashed"
  top : "rep-smashing-Against"
  top : "rep-smashing-Place"
  top : "rep-smashing-Agent"
  top : "rep-smearing-Tool"
  top : "rep-smearing-Item"
  top : "rep-smearing-Surface"
  top : "rep-smearing-Place"
  top : "rep-smearing-Agent"
  top : "rep-smelling-Place"
  top : "rep-smelling-Item"
  top : "rep-smelling-Agent"
  top : "rep-smiling-Agent"
  top : "rep-smiling-Place"
  top : "rep-sneezing-Agent"
  top : "rep-sneezing-Place"
  top : "rep-sniffing-Place"
  top : "rep-sniffing-Item"
  top : "rep-sniffing-Agent"
  top : "rep-snowing-Place"
  top : "rep-snuggling-Place"
  top : "rep-snuggling-CoAgent"
  top : "rep-snuggling-Agent"
  top : "rep-soaking-Place"
  top : "rep-soaking-Item"
  top : "rep-soaking-Container"
  top : "rep-soaking-Substance"
  top : "rep-soaking-Agent"
  top : "rep-soaring-Agent"
  top : "rep-soaring-Place"
  top : "rep-socializing-Place"
  top : "rep-socializing-CoAgent"
  top : "rep-socializing-Agent"
  top : "rep-sowing-Place"
  top : "rep-sowing-Tool"
  top : "rep-sowing-Agent"
  top : "rep-spanking-Place"
  top : "rep-spanking-Tool"
  top : "rep-spanking-Agent"
  top : "rep-spanking-Victim"
  top : "rep-speaking-Place"
  top : "rep-speaking-CoAgent"
  top : "rep-speaking-Agent"
  top : "rep-spearing-Victim"
  top : "rep-spearing-Place"
  top : "rep-spearing-Agent"
  top : "rep-spilling-Source"
  top : "rep-spilling-Destination"
  top : "rep-spilling-Place"
  top : "rep-spilling-Substance"
  top : "rep-spilling-Agent"
  top : "rep-spinning-Material"
  top : "rep-spinning-Tool"
  top : "rep-spinning-Agent"
  top : "rep-spinning-Place"
  top : "rep-spitting-Place"
  top : "rep-spitting-Item"
  top : "rep-spitting-Agent"
  top : "rep-spitting-Target"
  top : "rep-splashing-Tool"
  top : "rep-splashing-Place"
  top : "rep-splashing-Substance"
  top : "rep-splashing-Destination"
  top : "rep-splashing-Agent"
  top : "rep-spoiling-Agent"
  top : "rep-spoiling-Place"
  top : "rep-spraying-Source"
  top : "rep-spraying-Destination"
  top : "rep-spraying-Place"
  top : "rep-spraying-Substance"
  top : "rep-spraying-Agent"
  top : "rep-spreading-Substance"
  top : "rep-spreading-Tool"
  top : "rep-spreading-Surface"
  top : "rep-spreading-Place"
  top : "rep-spreading-Agent"
  top : "rep-sprinkling-Destination"
  top : "rep-sprinkling-Item"
  top : "rep-sprinkling-Agent"
  top : "rep-sprinkling-Place"
  top : "rep-sprinkling-Source"
  top : "rep-sprinting-Agent"
  top : "rep-sprinting-Place"
